Revit 2026 API

# TransformIdentity Property

---

The identity transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Transform Identity { get; }
```
```vb
Public Shared ReadOnly Property Identity As Transform
	Get
```
```cpp
public:
static property Transform^ Identity {
	Transform^ get ();
}
```
```fsharp
static member Identity : Transform with get
```

#### Property Value

Transform

The identity transformation does not change a point or a vector that it is applied to.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace